tweeter_app_api/app/controllers/tweets_controller.rb

SELECT "tweets".* FROM "tweets"
---
    def index
        render json: {status: 200, tweets: Tweet.all}

SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        tweet = Tweet.find(params[:id])

INSERT INTO "tweets" ("title", "content", "author", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Hello"], ["content", "World"], ["author", "Alex"], ["created_at", "2021-02-23 22:10:42.894344"], ["updated_at", "2021-02-23 22:10:42.894344"]]
---
    def create
        tweet = Tweet.new(tweet_params)
        if tweet.save

SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "tweets" SET "author" = $1, "updated_at" = $2 WHERE "tweets"."id" = $3  [["author", "Alex Chaconas"], ["updated_at", "2021-02-23 22:20:34.404347"], ["id", 3]]
---
    def update
        tweet = Tweet.find(params[:id])
        tweet.update(tweet_params)

DELETE FROM "tweets" WHERE "tweets"."id" = $1  [["id", 3]]
---
    def destroy
        tweet = Tweet.destroy(params[:id])